app/controllers/bugs_controller.rb

  def new
    @bug = Bug.new
	@bug.projeto = Projeto.find(params[:projeto_id])
---
SELECT * FROM "projetos" WHERE ("projetos"."id" = 1)

  def create
    @bug = Bug.new(params[:bug])

    respond_to do |format|
      if @bug.save
---
INSERT INTO "bugs" ("updated_at", "projeto_id", "descricao", "created_at") VALUES('2009-04-22 22:23:38', 1, 'bug ', '2009-04-22 22:23:38')