app/controllers/projetos_controller.rb

SELECT * FROM "projetos"
---
  def index
    @projetos = Projeto.all

SELECT * FROM "projetos" WHERE ("projetos"."id" = 1)
---
  def show
    @projeto = Projeto.find(params[:id])

SELECT * FROM "projetos" WHERE ("projetos"."id" = 1)
---
  def edit
    @projeto = Projeto.find(params[:id])

INSERT INTO "projetos" ("updated_at", "nome", "responsavel", "descricao", "created_at") VALUES('2009-04-22 20:59:58', 'Introdução Rails', 'Paulo Mota', 'aprender rails apartir da apresentação de Túlio Ornelas', '2009-04-22 20:59:58')
---
  def create
    @projeto = Projeto.new(params[:projeto])

    respond_to do |format|
      if @projeto.save

SELECT * FROM "projetos" WHERE ("projetos"."id" = 2)
DELETE FROM "projetos" WHERE "id" = 2
---
  def destroy
    @projeto = Projeto.find(params[:id])
    @projeto.destroy